zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FLASH.h
#define FLASH_MCR_WDIE_MASK                      (0x1000U)
#define FLASH_MCR_WDIE_SHIFT                     (12U)
/*! WDIE - Watch Dog Interrupt Enable
 *  0b0..Watchdog interrupt not enabled
 *  0b1..Watchdog interrupt enabled
 */
#define FLASH_MCR_WDIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_WDIE_SHIFT)) & FLASH_MCR_WDIE_MASK)

#define FLASH_MCR_PECIE_MASK                     (0x8000U)
#define FLASH_MCR_PECIE_SHIFT                    (15U)
/*! PECIE - Program/Erase Complete Interrupt Enable
 *  0b0..Interrupt request not generated when MCRS[DONE] is 1
 *  0b1..Interrupt request generated when MCRS[DONE] is 1
 */
#define FLASH_MCR_PECIE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PECIE_SHIFT)) & FLASH_MCR_PECIE_MASK)

#define FLASH_MCR_PEID_MASK                      (0xFF0000U)
#define FLASH_MCR_PEID_SHIFT                     (16U)
/*! PEID - Program and Erase Master/Domain ID */
#define FLASH_MCR_PEID(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PEID_SHIFT)) & FLASH_MCR_PEID_MASK)
/*! @} */

/*! @name MCRS - Module Configuration Status */
/*! @{ */

#define FLASH_MCRS_RE_MASK                       (0x1U)
#define FLASH_MCRS_RE_SHIFT                      (0U)
/*! RE - Reset Error
 *  0b0..Reset occurred without errors
 *  0b1..Reset error encountered
 */
#define FLASH_MCRS_RE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RE_SHIFT)) & FLASH_MCRS_RE_MASK)

#define FLASH_MCRS_TSPELOCK_MASK                 (0x100U)
#define FLASH_MCRS_TSPELOCK_SHIFT                (8U)
/*! TSPELOCK - UTest NVM Program and Erase Lock
 *  0b0..Corresponding sector not locked, and may be programmed or erased
 *  0b1..Corresponding sector protected from the program and erase sequences
 */
#define FLASH_MCRS_TSPELOCK(x)                   (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_TSPELOCK_SHIFT)) & FLASH_MCRS_TSPELOCK_MASK)

#define FLASH_MCRS_EPEG_MASK                     (0x200U)
#define FLASH_MCRS_EPEG_SHIFT                    (9U)
/*! EPEG - ECC Enabled Program/Erase Good
 *  0b0..Program or erase operation did not require ECC Enabled verifies.
 *  0b1..Program or erase operation required ECC Enabled verifies to pass.
 */
#define FLASH_MCRS_EPEG(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EPEG_SHIFT)) & FLASH_MCRS_EPEG_MASK)

#define FLASH_MCRS_WDI_MASK                      (0x1000U)
#define FLASH_MCRS_WDI_SHIFT                     (12U)
/*! WDI - Watch Dog Interrupt
 *  0b0..Normal Operation, Watchdog Timer has not expired.
 *  0b1..Program Watchdog Timer has expired.
 */
#define FLASH_MCRS_WDI(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_WDI_SHIFT)) & FLASH_MCRS_WDI_MASK)

#define FLASH_MCRS_PEG_MASK                      (0x4000U)
#define FLASH_MCRS_PEG_SHIFT                     (14U)
/*! PEG - Program/Erase Good
 *  0b0..Program or erase operation failed
 *  0b1..Program or erase operation successful
 */
#define FLASH_MCRS_PEG(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PEG_SHIFT)) & FLASH_MCRS_PEG_MASK)

#define FLASH_MCRS_DONE_MASK                     (0x8000U)
#define FLASH_MCRS_DONE_SHIFT                    (15U)
/*! DONE - State Machine Status
 *  0b0..Performing a high voltage operation
 *  0b1..Not executing a high voltage operation
 */
#define FLASH_MCRS_DONE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_DONE_SHIFT)) & FLASH_MCRS_DONE_MASK)

#define FLASH_MCRS_PES_MASK                      (0x10000U)
#define FLASH_MCRS_PES_SHIFT                     (16U)
/*! PES - Program and Erase Sequence Error
 *  0b0..Program and erase sequence errors do not exist
 *  0b1..Previous program or erase sequence encountered an error
 */
#define FLASH_MCRS_PES(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PES_SHIFT)) & FLASH_MCRS_PES_MASK)

#define FLASH_MCRS_PEP_MASK                      (0x20000U)
#define FLASH_MCRS_PEP_SHIFT                     (17U)
/*! PEP - Program and Erase Protection Error
 *  0b0..Program and erase protection errors do not exist
 *  0b1..Previous program or erase protection error encountered
 */
#define FLASH_MCRS_PEP(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PEP_SHIFT)) & FLASH_MCRS_PEP_MASK)

#define FLASH_MCRS_RWE_MASK                      (0x100000U)
#define FLASH_MCRS_RWE_SHIFT                     (20U)
/*! RWE - Read-While-Write Event Error
 *  0b0..Reads occur normally
 *  0b1..RWW error occurred during a previous read
 */
#define FLASH_MCRS_RWE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RWE_SHIFT)) & FLASH_MCRS_RWE_MASK)

#define FLASH_MCRS_RRE_MASK                      (0x1000000U)
#define FLASH_MCRS_RRE_SHIFT                     (24U)
/*! RRE - Read Reference Error
 *  0b0..Reads occur without reference issues
 *  0b1..Previous read may be corrupted because of read reference being out of range
 */
#define FLASH_MCRS_RRE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RRE_SHIFT)) & FLASH_MCRS_RRE_MASK)

#define FLASH_MCRS_RVE_MASK                      (0x2000000U)
#define FLASH_MCRS_RVE_SHIFT                     (25U)
/*! RVE - Read Voltage Error
 *  0b0..Reads are occurring without voltage issues
 *  0b1..A previous read may have been corrupted due to read voltage being out of range
 */
#define FLASH_MCRS_RVE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RVE_SHIFT)) & FLASH_MCRS_RVE_MASK)

#define FLASH_MCRS_EEE_MASK                      (0x10000000U)
#define FLASH_MCRS_EEE_SHIFT                     (28U)
/*! EEE - EDC after ECC Error
 *  0b0..Reads are occurring without EDC after ECC mismatches
 *  0b1..Previous read may be corrupted based on ECC calculation errors
 */
#define FLASH_MCRS_EEE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EEE_SHIFT)) & FLASH_MCRS_EEE_MASK)

#define FLASH_MCRS_AEE_MASK                      (0x20000000U)
#define FLASH_MCRS_AEE_SHIFT                     (29U)
/*! AEE - Address Encode Error
 *  0b0..Reads are occurring without address encode mismatches
 *  0b1..Previous read may be corrupted based on address encode mismatch
 */
#define FLASH_MCRS_AEE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_AEE_SHIFT)) & FLASH_MCRS_AEE_MASK)

#define FLASH_MCRS_SBC_MASK                      (0x40000000U)
#define FLASH_MCRS_SBC_SHIFT                     (30U)
/*! SBC - Single Bit Correction
 *  0b0..Reads occurring without corrections
 *  0b1..Single bit correction occurred during a previous read
 */
#define FLASH_MCRS_SBC(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_SBC_SHIFT)) & FLASH_MCRS_SBC_MASK)

