zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FLASH.h
#define FLASH_MCRS_EER_MASK                      (0x80000000U)
#define FLASH_MCRS_EER_SHIFT                     (31U)
/*! EER - ECC Event Error
 *  0b0..Reads occurring normally
 *  0b1..ECC error occurred during a previous read
 */
#define FLASH_MCRS_EER(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EER_SHIFT)) & FLASH_MCRS_EER_MASK)
/*! @} */

/*! @name MCRE - Extended Module Configuration */
/*! @{ */

#define FLASH_MCRE_n256K_MASK                    (0xC0U)
#define FLASH_MCRE_n256K_SHIFT                   (6U)
/*! n256K - Number of 256 KB Blocks
 *  0b00..Zero 256 KB blocks
 *  0b01..One 256 KB block
 *  0b10..Two 256 KB blocks
 *  0b11..Four 256 KB blocks
 */
#define FLASH_MCRE_n256K(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n256K_SHIFT)) & FLASH_MCRE_n256K_MASK)

#define FLASH_MCRE_n512K_MASK                    (0xC000U)
#define FLASH_MCRE_n512K_SHIFT                   (14U)
/*! n512K - Number of 512 KB Blocks
 *  0b00..Zero 512 KB blocks
 *  0b01..One 512 KB block
 *  0b10..Two 512 KB blocks
 *  0b11..Four 512 KB blocks
 */
#define FLASH_MCRE_n512K(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n512K_SHIFT)) & FLASH_MCRE_n512K_MASK)

#define FLASH_MCRE_n1M_MASK                      (0xE00000U)
#define FLASH_MCRE_n1M_SHIFT                     (21U)
/*! n1M - Number of 1 MB Blocks
 *  0b000..Zero 1 MB blocks
 *  0b001..One 1 MB block
 *  0b010..Two 1 MB blocks
 *  0b011..Three 1 MB blocks
 *  0b100..Four 1 MB blocks
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..Reserved
 */
#define FLASH_MCRE_n1M(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n1M_SHIFT)) & FLASH_MCRE_n1M_MASK)
/*! @} */

/*! @name CTL - Module Control */
/*! @{ */

#define FLASH_CTL_RWSC_MASK                      (0x1F00U)
#define FLASH_CTL_RWSC_SHIFT                     (8U)
/*! RWSC - Wait State Control
 *  0b00000..Reserved
 *  0b00001..One additional wait state is added.
 *  0b00010..Two additional wait states are added.
 *  0b00011..Three additional wait states are added.
 *  0b00100..Four additional wait states are added.
 *  0b00101..Five additional wait states are added.
 *  0b00110..Six additional wait states are added.
 *  0b00111..Seven additional wait states are added.
 *  0b01000..Eight additional wait states are added.
 *  0b01001..Reserved
 *  0b11111..Reserved
 */
#define FLASH_CTL_RWSC(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_CTL_RWSC_SHIFT)) & FLASH_CTL_RWSC_MASK)

#define FLASH_CTL_RWSL_MASK                      (0x8000U)
#define FLASH_CTL_RWSL_SHIFT                     (15U)
/*! RWSL - Read Wait State Lock
 *  0b0..RWSC not locked and available for writing
 *  0b1..RWSC locked and unavailable for writing
 */
#define FLASH_CTL_RWSL(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_CTL_RWSL_SHIFT)) & FLASH_CTL_RWSL_MASK)
/*! @} */

/*! @name ADR - Address */
/*! @{ */

#define FLASH_ADR_ADDR_MASK                      (0x7FFFEU)
#define FLASH_ADR_ADDR_SHIFT                     (1U)
/*! ADDR - Address */
#define FLASH_ADR_ADDR(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_ADDR_SHIFT)) & FLASH_ADR_ADDR_MASK)

#define FLASH_ADR_A0_MASK                        (0x80000U)
#define FLASH_ADR_A0_SHIFT                       (19U)
/*! A0 - Address Region 0
 *  0b0..Address captured or to be accessed is not from region 0
 *  0b1..Address captured or to be accessed is from region 0
 */
#define FLASH_ADR_A0(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A0_SHIFT)) & FLASH_ADR_A0_MASK)

#define FLASH_ADR_A1_MASK                        (0x100000U)
#define FLASH_ADR_A1_SHIFT                       (20U)
/*! A1 - Address Region 1
 *  0b0..Address captured or to be accessed is not from region 1
 *  0b1..Address captured or to be accessed is from region 1
 */
#define FLASH_ADR_A1(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A1_SHIFT)) & FLASH_ADR_A1_MASK)

#define FLASH_ADR_A2_MASK                        (0x200000U)
#define FLASH_ADR_A2_SHIFT                       (21U)
/*! A2 - Address Region 2
 *  0b0..Address captured or to be accessed is not from region 2
 *  0b1..Address captured or to be accessed is from region 2
 */
#define FLASH_ADR_A2(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A2_SHIFT)) & FLASH_ADR_A2_MASK)

#define FLASH_ADR_A3_MASK                        (0x400000U)
#define FLASH_ADR_A3_SHIFT                       (22U)
/*! A3 - Address Region 3
 *  0b0..Address captured or to be accessed is not from region 3
 *  0b1..Address captured or to be accessed is from region 3
 */
#define FLASH_ADR_A3(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A3_SHIFT)) & FLASH_ADR_A3_MASK)

#define FLASH_ADR_A4_MASK                        (0x800000U)
#define FLASH_ADR_A4_SHIFT                       (23U)
/*! A4 - Address Region 4
 *  0b0..Address captured or to be accessed is not from region 4
 *  0b1..Address captured or to be accessed is from region 4
 */
#define FLASH_ADR_A4(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A4_SHIFT)) & FLASH_ADR_A4_MASK)

#define FLASH_ADR_A5_MASK                        (0x1000000U)
#define FLASH_ADR_A5_SHIFT                       (24U)
/*! A5 - Address Region 5
 *  0b0..Address captured or to be accessed is not from region 5
 *  0b1..Address captured or to be accessed is from region 5
 */
#define FLASH_ADR_A5(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A5_SHIFT)) & FLASH_ADR_A5_MASK)

#define FLASH_ADR_SAD_MASK                       (0x80000000U)
#define FLASH_ADR_SAD_SHIFT                      (31U)
/*! SAD - UTest NVM Address
 *  0b0..Address captured or to be accessed is from the main array space
 *  0b1..Address captured or to be accessed is from the UTest NVM array space
 */
#define FLASH_ADR_SAD(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_SAD_SHIFT)) & FLASH_ADR_SAD_MASK)
/*! @} */

/*! @name PEADR - Program and Erase Address */
/*! @{ */

#define FLASH_PEADR_PEADDR_MASK                  (0x7FFE0U)
#define FLASH_PEADR_PEADDR_SHIFT                 (5U)
/*! PEADDR - Program and Erase Address */
#define FLASH_PEADR_PEADDR(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEADDR_SHIFT)) & FLASH_PEADR_PEADDR_MASK)

#define FLASH_PEADR_PEA0_MASK                    (0x80000U)
#define FLASH_PEADR_PEA0_SHIFT                   (19U)
/*! PEA0 - Program and Erase Address Region 0
 *  0b0..Address accessed is not from region 0
 *  0b1..Address accessed is from region 0
 */
#define FLASH_PEADR_PEA0(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA0_SHIFT)) & FLASH_PEADR_PEA0_MASK)

#define FLASH_PEADR_PEA1_MASK                    (0x100000U)
#define FLASH_PEADR_PEA1_SHIFT                   (20U)
/*! PEA1 - Program and Erase Address Region 1
 *  0b0..Address accessed is not from region 1
 *  0b1..Address accessed is from region 1
 */
#define FLASH_PEADR_PEA1(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA1_SHIFT)) & FLASH_PEADR_PEA1_MASK)

