zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FLASH.h
#define FLASH_PEADR_PEA2_MASK                    (0x200000U)
#define FLASH_PEADR_PEA2_SHIFT                   (21U)
/*! PEA2 - Program and Erase Address Region 2
 *  0b0..Address accessed is not from region 2
 *  0b1..Address accessed is from region 2
 */
#define FLASH_PEADR_PEA2(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA2_SHIFT)) & FLASH_PEADR_PEA2_MASK)

#define FLASH_PEADR_PEA3_MASK                    (0x400000U)
#define FLASH_PEADR_PEA3_SHIFT                   (22U)
/*! PEA3 - Program and Erase Address Region 3
 *  0b0..Address accessed is not from region 3
 *  0b1..Address accessed is from region 3
 */
#define FLASH_PEADR_PEA3(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA3_SHIFT)) & FLASH_PEADR_PEA3_MASK)

#define FLASH_PEADR_PEA4_MASK                    (0x800000U)
#define FLASH_PEADR_PEA4_SHIFT                   (23U)
/*! PEA4 - Program and Erase Address Region 4
 *  0b0..Address accessed is not from region 4
 *  0b1..Adrress accessed is from region 4
 */
#define FLASH_PEADR_PEA4(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA4_SHIFT)) & FLASH_PEADR_PEA4_MASK)

#define FLASH_PEADR_PEA5_MASK                    (0x1000000U)
#define FLASH_PEADR_PEA5_SHIFT                   (24U)
/*! PEA5 - Program and Erase Address Region 5
 *  0b0..Address accessed is not from region 5
 *  0b1..Address accessed is from region 5
 */
#define FLASH_PEADR_PEA5(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA5_SHIFT)) & FLASH_PEADR_PEA5_MASK)

#define FLASH_PEADR_PEASAD_MASK                  (0x80000000U)
#define FLASH_PEADR_PEASAD_SHIFT                 (31U)
/*! PEASAD - UTest NVM Program and Erase Address
 *  0b0..Address accessed is from the main array space
 *  0b1..Address accessed is from the UTest NVM array space
 */
#define FLASH_PEADR_PEASAD(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEASAD_SHIFT)) & FLASH_PEADR_PEASAD_MASK)
/*! @} */

/*! @name SPELOCK - Sector Program and Erase Hardware Lock */
/*! @{ */

#define FLASH_SPELOCK_SPELOCK_MASK               (0xFFFFFFFFU)
#define FLASH_SPELOCK_SPELOCK_SHIFT              (0U)
/*! SPELOCK - Sector Program and Erase Lock [31:0] */
#define FLASH_SPELOCK_SPELOCK(x)                 (((uint32_t)(((uint32_t)(x)) << FLASH_SPELOCK_SPELOCK_SHIFT)) & FLASH_SPELOCK_SPELOCK_MASK)
/*! @} */

/*! @name SSPELOCK - Super Sector Program and Erase Hardware Lock */
/*! @{ */

#define FLASH_SSPELOCK_SSPELOCK_MASK             (0xFFFU)
#define FLASH_SSPELOCK_SSPELOCK_SHIFT            (0U)
/*! SSPELOCK - Super Sector Program and Erase Lock [11:0] */
#define FLASH_SSPELOCK_SSPELOCK(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_SSPELOCK_SSPELOCK_SHIFT)) & FLASH_SSPELOCK_SSPELOCK_MASK)
/*! @} */

/*! @name XSPELOCK - Express Sector Program and Erase Hardware Lock */
/*! @{ */

#define FLASH_XSPELOCK_XSPELOCK_MASK             (0xFFFFFFFFU)
#define FLASH_XSPELOCK_XSPELOCK_SHIFT            (0U)
/*! XSPELOCK - Express Sector Program and Erase Lock [31:0] */
#define FLASH_XSPELOCK_XSPELOCK(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_XSPELOCK_XSPELOCK_SHIFT)) & FLASH_XSPELOCK_XSPELOCK_MASK)
/*! @} */

/*! @name XSSPELOCK - Express Super Sector Program and Erase Hardware Lock */
/*! @{ */

#define FLASH_XSSPELOCK_XSSPELOCK_MASK           (0xFFFU)
#define FLASH_XSSPELOCK_XSSPELOCK_SHIFT          (0U)
/*! XSSPELOCK - Express Super Sector Program and Erase Lock [11:0] */
#define FLASH_XSSPELOCK_XSSPELOCK(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_XSSPELOCK_XSSPELOCK_SHIFT)) & FLASH_XSSPELOCK_XSSPELOCK_MASK)
/*! @} */

/*! @name TMD - Test Mode Disable Password Check */
/*! @{ */

#define FLASH_TMD_PWD_MASK                       (0xFFFFFFFFU)
#define FLASH_TMD_PWD_SHIFT                      (0U)
/*! PWD - Password Challenge */
#define FLASH_TMD_PWD(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_TMD_PWD_SHIFT)) & FLASH_TMD_PWD_MASK)
/*! @} */

/*! @name UT0 - UTest 0 */
/*! @{ */

#define FLASH_UT0_AID_MASK                       (0x1U)
#define FLASH_UT0_AID_SHIFT                      (0U)
/*! AID - Array Integrity Done
 *  0b0..Array integrity check ongoing
 *  0b1..Array integrity check complete
 */
#define FLASH_UT0_AID(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AID_SHIFT)) & FLASH_UT0_AID_MASK)

#define FLASH_UT0_AIE_MASK                       (0x2U)
#define FLASH_UT0_AIE_SHIFT                      (1U)
/*! AIE - Array Integrity Enable
 *  0b0..Array integrity checks not enabled
 *  0b1..Array integrity checks enabled
 */
#define FLASH_UT0_AIE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIE_SHIFT)) & FLASH_UT0_AIE_MASK)

#define FLASH_UT0_AIS_MASK                       (0x4U)
#define FLASH_UT0_AIS_SHIFT                      (2U)
/*! AIS - Array Integrity Sequence
 *  0b0..Array integrity sequence is proprietary sequence
 *  0b1..Array integrity sequence is sequential
 */
#define FLASH_UT0_AIS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIS_SHIFT)) & FLASH_UT0_AIS_MASK)

#define FLASH_UT0_MRV_MASK                       (0x10U)
#define FLASH_UT0_MRV_SHIFT                      (4U)
/*! MRV - Margin Read Value
 *  0b0..Zero's margin reads are requested.
 *  0b1..One's margin reads are requested.
 */
#define FLASH_UT0_MRV(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_MRV_SHIFT)) & FLASH_UT0_MRV_MASK)

#define FLASH_UT0_MRE_MASK                       (0x20U)
#define FLASH_UT0_MRE_SHIFT                      (5U)
/*! MRE - Margin Read Enable
 *  0b0..Margin reads are not enabled.
 *  0b1..Margin reads are enabled.
 */
#define FLASH_UT0_MRE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_MRE_SHIFT)) & FLASH_UT0_MRE_MASK)

#define FLASH_UT0_AISUS_MASK                     (0x40U)
#define FLASH_UT0_AISUS_SHIFT                    (6U)
/*! AISUS - Array Integrity Suspend
 *  0b0..Array integrity sequence not suspended.
 *  0b1..Array integrity sequence is suspended.
 */
#define FLASH_UT0_AISUS(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AISUS_SHIFT)) & FLASH_UT0_AISUS_MASK)

