zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FLASH.h
#define FLASH_UD4_EDDATA_MASK                    (0xFFFFFFFFU)
#define FLASH_UD4_EDDATA_SHIFT                   (0U)
/*! EDDATA - EDC After ECC Data [63:31] */
#define FLASH_UD4_EDDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD4_EDDATA_SHIFT)) & FLASH_UD4_EDDATA_MASK)
/*! @} */

/*! @name UD5 - UTest Data 5 */
/*! @{ */

#define FLASH_UD5_EDDATAC_MASK                   (0xFFU)
#define FLASH_UD5_EDDATAC_SHIFT                  (0U)
/*! EDDATAC - EDC After ECC Data Check Bits [7:0] */
#define FLASH_UD5_EDDATAC(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDDATAC_SHIFT)) & FLASH_UD5_EDDATAC_MASK)

#define FLASH_UD5_EDD0_MASK                      (0x1000000U)
#define FLASH_UD5_EDD0_SHIFT                     (24U)
/*! EDD0 - EDC After ECC Logic Check Double Word 0 */
#define FLASH_UD5_EDD0(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD0_SHIFT)) & FLASH_UD5_EDD0_MASK)

#define FLASH_UD5_EDD1_MASK                      (0x2000000U)
#define FLASH_UD5_EDD1_SHIFT                     (25U)
/*! EDD1 - EDC After ECC Logic Check Double Word 1 */
#define FLASH_UD5_EDD1(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD1_SHIFT)) & FLASH_UD5_EDD1_MASK)

#define FLASH_UD5_EDD2_MASK                      (0x4000000U)
#define FLASH_UD5_EDD2_SHIFT                     (26U)
/*! EDD2 - EDC after ECC Logic Check Double Word 2 */
#define FLASH_UD5_EDD2(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD2_SHIFT)) & FLASH_UD5_EDD2_MASK)

#define FLASH_UD5_EDD3_MASK                      (0x8000000U)
#define FLASH_UD5_EDD3_SHIFT                     (27U)
/*! EDD3 - EDC After ECC Logic Check Double Word 3 */
#define FLASH_UD5_EDD3(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD3_SHIFT)) & FLASH_UD5_EDD3_MASK)
/*! @} */

/*! @name UA0 - UTest Address 0 */
/*! @{ */

#define FLASH_UA0_AEI_MASK                       (0xFFFFFFFFU)
#define FLASH_UA0_AEI_SHIFT                      (0U)
/*! AEI - Address Encode Invert [31:0] */
#define FLASH_UA0_AEI(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UA0_AEI_SHIFT)) & FLASH_UA0_AEI_MASK)
/*! @} */

/*! @name UA1 - UTest Address 1 */
/*! @{ */

#define FLASH_UA1_AEI_MASK                       (0xFFFFFU)
#define FLASH_UA1_AEI_SHIFT                      (0U)
/*! AEI - Address Encode Invert [51:32] */
#define FLASH_UA1_AEI(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UA1_AEI_SHIFT)) & FLASH_UA1_AEI_MASK)
/*! @} */

/*! @name XMCR - Express Module Configuration */
/*! @{ */

#define FLASH_XMCR_XEHV_MASK                     (0x1U)
#define FLASH_XMCR_XEHV_SHIFT                    (0U)
/*! XEHV - Express Enable High Voltage
 *  0b0..Flash memory is not enabled to perform an express high voltage operation.
 *  0b1..Flash memory is enabled to perform an express high voltage operation.
 */
#define FLASH_XMCR_XEHV(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XEHV_SHIFT)) & FLASH_XMCR_XEHV_MASK)

#define FLASH_XMCR_XPGM_MASK                     (0x100U)
#define FLASH_XMCR_XPGM_SHIFT                    (8U)
/*! XPGM - Express Program
 *  0b0..Flash memory not executing an express program sequence
 *  0b1..Flash memory executing an express program sequence
 */
#define FLASH_XMCR_XPGM(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPGM_SHIFT)) & FLASH_XMCR_XPGM_MASK)

#define FLASH_XMCR_XEPEG_MASK                    (0x200U)
#define FLASH_XMCR_XEPEG_SHIFT                   (9U)
/*! XEPEG - Express ECC Enabled Program Good
 *  0b0..Program operation did not require ECC-enabled verifies
 *  0b1..Program operation required ECC-enabled verifies to pass
 */
#define FLASH_XMCR_XEPEG(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XEPEG_SHIFT)) & FLASH_XMCR_XEPEG_MASK)

#define FLASH_XMCR_XWDIE_MASK                    (0x800U)
#define FLASH_XMCR_XWDIE_SHIFT                   (11U)
/*! XWDIE - Express Watch Dog Interrupt Enable
 *  0b0..Express watchdog interrupt disabled
 *  0b1..Express watchdog interrupt enabled
 */
#define FLASH_XMCR_XWDIE(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XWDIE_SHIFT)) & FLASH_XMCR_XWDIE_MASK)

#define FLASH_XMCR_XWDI_MASK                     (0x1000U)
#define FLASH_XMCR_XWDI_SHIFT                    (12U)
/*! XWDI - Express Watch Dog Interrupt
 *  0b0..Normal Operation, Watchdog Timer has not expired.
 *  0b1..Express Program Watchdog Timer has expired.
 */
#define FLASH_XMCR_XWDI(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XWDI_SHIFT)) & FLASH_XMCR_XWDI_MASK)

#define FLASH_XMCR_XDOK_MASK                     (0x2000U)
#define FLASH_XMCR_XDOK_SHIFT                    (13U)
/*! XDOK - Express Data OK
 *  0b0..Flash memory not ready to accept writes to the DATA registers
 *  0b1..Writes to DATA registers allowed
 */
#define FLASH_XMCR_XDOK(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XDOK_SHIFT)) & FLASH_XMCR_XDOK_MASK)

#define FLASH_XMCR_XPEG_MASK                     (0x4000U)
#define FLASH_XMCR_XPEG_SHIFT                    (14U)
/*! XPEG - Express Program Good
 *  0b0..Program operation failed
 *  0b1..Program operation successful
 */
#define FLASH_XMCR_XPEG(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPEG_SHIFT)) & FLASH_XMCR_XPEG_MASK)

#define FLASH_XMCR_XDONE_MASK                    (0x8000U)
#define FLASH_XMCR_XDONE_SHIFT                   (15U)
/*! XDONE - Express State Machine Status
 *  0b0..Executing an express program operation
 *  0b1..Not executing an express program operation
 */
#define FLASH_XMCR_XDONE(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XDONE_SHIFT)) & FLASH_XMCR_XDONE_MASK)

#define FLASH_XMCR_XPEID_MASK                    (0xFF0000U)
#define FLASH_XMCR_XPEID_SHIFT                   (16U)
/*! XPEID - Express Program Master/Domain ID */
#define FLASH_XMCR_XPEID(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPEID_SHIFT)) & FLASH_XMCR_XPEID_MASK)
/*! @} */

/*! @name XPEADR - Express Program Address */
/*! @{ */

#define FLASH_XPEADR_XPEADDR_MASK                (0x7FFE0U)
#define FLASH_XPEADR_XPEADDR_SHIFT               (5U)
/*! XPEADDR - Express Program Address */
#define FLASH_XPEADR_XPEADDR(x)                  (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEADDR_SHIFT)) & FLASH_XPEADR_XPEADDR_MASK)

#define FLASH_XPEADR_XPEA0_MASK                  (0x80000U)
#define FLASH_XPEADR_XPEA0_SHIFT                 (19U)
/*! XPEA0 - Express Program Address Region 0
 *  0b0..Address accessed is not from region 0
 *  0b1..Address accessed is from region 0
 */
#define FLASH_XPEADR_XPEA0(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA0_SHIFT)) & FLASH_XPEADR_XPEA0_MASK)

#define FLASH_XPEADR_XPEA1_MASK                  (0x100000U)
#define FLASH_XPEADR_XPEA1_SHIFT                 (20U)
/*! XPEA1 - Express Program Address Region 1
 *  0b0..Address accessed is not from region 1
 *  0b1..Address accessed is from region 1
 */
#define FLASH_XPEADR_XPEA1(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA1_SHIFT)) & FLASH_XPEADR_XPEA1_MASK)

#define FLASH_XPEADR_XPEA2_MASK                  (0x200000U)
#define FLASH_XPEADR_XPEA2_SHIFT                 (21U)
/*! XPEA2 - Express Program Address Region 2
 *  0b0..Address accessed is not from region 2
 *  0b1..Address accessed is from region 2
 */
#define FLASH_XPEADR_XPEA2(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA2_SHIFT)) & FLASH_XPEADR_XPEA2_MASK)

