zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FLASH.h
#define FLASH_XPEADR_XPEA3_MASK                  (0x400000U)
#define FLASH_XPEADR_XPEA3_SHIFT                 (22U)
/*! XPEA3 - Express Program Address Region 3
 *  0b0..Address accessed is not from region 3
 *  0b1..Address accessed is from region 3
 */
#define FLASH_XPEADR_XPEA3(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA3_SHIFT)) & FLASH_XPEADR_XPEA3_MASK)

#define FLASH_XPEADR_XPEA4_MASK                  (0x800000U)
#define FLASH_XPEADR_XPEA4_SHIFT                 (23U)
/*! XPEA4 - Express Program Address Region 4
 *  0b0..Address accessed is not from region 4
 *  0b1..Address accessed is from region 4
 */
#define FLASH_XPEADR_XPEA4(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA4_SHIFT)) & FLASH_XPEADR_XPEA4_MASK)

#define FLASH_XPEADR_XPEA5_MASK                  (0x1000000U)
#define FLASH_XPEADR_XPEA5_SHIFT                 (24U)
/*! XPEA5 - Express Program Address Region 5
 *  0b0..Address accessed is not from region 5
 *  0b1..Address accessed is from region 5
 */
#define FLASH_XPEADR_XPEA5(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA5_SHIFT)) & FLASH_XPEADR_XPEA5_MASK)
/*! @} */

/*! @name DATA - Program Data */
/*! @{ */

#define FLASH_DATA_PDATA_MASK                    (0xFFFFFFFFU)
#define FLASH_DATA_PDATA_SHIFT                   (0U)
/*! PDATA - Program Data */
#define FLASH_DATA_PDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_DATA_PDATA_SHIFT)) & FLASH_DATA_PDATA_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FLASH_Register_Masks */


/*!
 * @}
 */ /* end of group FLASH_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_FLASH_H_ */

